# !$!-Проверка правильности привязки файлов-!$! 
# с использованием Commit к GitHub
# !!!Первая итерация!!! - привязка к GitHub
# Стоит # N (N=1)
# После привязки считываем этот файл и уже в
# VSC его снова редактируем и 
# Ставим # M=N+1
# 
# $$$Вторая итерация$$$ - повторная привязка к GitHub
# Стоит # N (N=2)
# После привязки считываем этот файл и уже в
# VSC его снова редактируем и 
# Ставим # M=N+1
# 
# Результатом всех этих итераций в строке #8
# должна стоять "2", в строке # 14 должна стоять "3"
# !$!-ОКОНЧАНИЕ ПРОВЕРКИ-!$!